Train/Train17/train_mongo_17.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.5">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <com.blazemeter.jmeter.threads.concurrency.ConcurrencyThreadGroup guiclass="com.blazemeter.jmeter.threads.concurrency.ConcurrencyThreadGroupGui" testclass="com.blazemeter.jmeter.threads.concurrency.ConcurrencyThreadGroup" testname="bzm - Concurrency Thread Group" enabled="true">
        <elementProp name="ThreadGroup.main_controller" elementType="com.blazemeter.jmeter.control.VirtualUserController"/>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <stringProp name="TargetLevel">${__tstFeedback(tst-name,50,50,1)}</stringProp>
        <stringProp name="RampUp">0</stringProp>
        <stringProp name="Steps">0</stringProp>
        <stringProp name="Hold">4000</stringProp>
        <stringProp name="Unit">S</stringProp>
      </com.blazemeter.jmeter.threads.concurrency.ConcurrencyThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Request" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">193.225.250.30</stringProp>
          <stringProp name="HTTPSampler.path">/mongodb/expense/regex/abc</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <kg.apc.jmeter.timers.VariableThroughputTimer guiclass="kg.apc.jmeter.timers.VariableThroughputTimerGui" testclass="kg.apc.jmeter.timers.VariableThroughputTimer" testname="tst-name" enabled="false">
            <collectionProp name="load_profile">
              <collectionProp name="1873396989">
                <stringProp name="49">1</stringProp>
                <stringProp name="1598">20</stringProp>
                <stringProp name="1567">10</stringProp>
              </collectionProp>
              <collectionProp name="-238538048">
                <stringProp name="1598">20</stringProp>
                <stringProp name="1598">20</stringProp>
                <stringProp name="1567">10</stringProp>
              </collectionProp>
              <collectionProp name="-237546197">
                <stringProp name="1598">20</stringProp>
                <stringProp name="1660">40</stringProp>
                <stringProp name="1598">20</stringProp>
              </collectionProp>
              <collectionProp name="-1971499986">
                <stringProp name="1598">20</stringProp>
                <stringProp name="51">3</stringProp>
                <stringProp name="1567">10</stringProp>
              </collectionProp>
              <collectionProp name="141254784">
                <stringProp name="51">3</stringProp>
                <stringProp name="51">3</stringProp>
                <stringProp name="1567">10</stringProp>
              </collectionProp>
            </collectionProp>
          </kg.apc.jmeter.timers.VariableThroughputTimer>
          <hashTree/>
          <kg.apc.jmeter.timers.VariableThroughputTimer guiclass="kg.apc.jmeter.timers.VariableThroughputTimerGui" testclass="kg.apc.jmeter.timers.VariableThroughputTimer" testname="tst-name" enabled="false">
            <collectionProp name="load_profile">
              <collectionProp name="1925865314">
                <stringProp name="50">2</stringProp>
                <stringProp name="50">2</stringProp>
                <stringProp name="48625">100</stringProp>
              </collectionProp>
              <collectionProp name="-636247645">
                <stringProp name="50">2</stringProp>
                <stringProp name="1567">10</stringProp>
                <stringProp name="48625">100</stringProp>
              </collectionProp>
              <collectionProp name="1542629250">
                <stringProp name="1567">10</stringProp>
                <stringProp name="1567">10</stringProp>
                <stringProp name="48625">100</stringProp>
              </collectionProp>
              <collectionProp name="1542738029">
                <stringProp name="1567">10</stringProp>
                <stringProp name="1598">20</stringProp>
                <stringProp name="48625">100</stringProp>
              </collectionProp>
              <collectionProp name="1546110178">
                <stringProp name="1598">20</stringProp>
                <stringProp name="1598">20</stringProp>
                <stringProp name="48625">100</stringProp>
              </collectionProp>
              <collectionProp name="1546965654">
                <stringProp name="1598">20</stringProp>
                <stringProp name="1629">30</stringProp>
                <stringProp name="48625">100</stringProp>
              </collectionProp>
              <collectionProp name="1573485410">
                <stringProp name="1629">30</stringProp>
                <stringProp name="1629">30</stringProp>
                <stringProp reference="../../collectionProp[6]/stringProp[3]"/>
              </collectionProp>
              <collectionProp name="1573618276">
                <stringProp name="1629">30</stringProp>
                <stringProp name="1660">40</stringProp>
                <stringProp reference="../../collectionProp[6]/stringProp[3]"/>
              </collectionProp>
              <collectionProp name="1577737122">
                <stringProp name="1660">40</stringProp>
                <stringProp name="1660">40</stringProp>
                <stringProp reference="../../collectionProp[6]/stringProp[3]"/>
              </collectionProp>
              <collectionProp name="1577737122">
                <stringProp name="1660">40</stringProp>
                <stringProp name="1660">40</stringProp>
                <stringProp reference="../../collectionProp[6]/stringProp[3]"/>
              </collectionProp>
              <collectionProp name="1577604256">
                <stringProp name="1660">40</stringProp>
                <stringProp name="1629">30</stringProp>
                <stringProp reference="../../collectionProp[6]/stringProp[3]"/>
              </collectionProp>
              <collectionProp name="1573485410">
                <stringProp name="1629">30</stringProp>
                <stringProp name="1629">30</stringProp>
                <stringProp reference="../../collectionProp[6]/stringProp[3]"/>
              </collectionProp>
              <collectionProp name="1572629934">
                <stringProp name="1629">30</stringProp>
                <stringProp name="1598">20</stringProp>
                <stringProp reference="../../collectionProp[6]/stringProp[3]"/>
              </collectionProp>
              <collectionProp name="1546110178">
                <stringProp name="1598">20</stringProp>
                <stringProp name="1598">20</stringProp>
                <stringProp reference="../../collectionProp[6]/stringProp[3]"/>
              </collectionProp>
              <collectionProp name="1546001399">
                <stringProp name="1598">20</stringProp>
                <stringProp name="1567">10</stringProp>
                <stringProp reference="../../collectionProp[6]/stringProp[3]"/>
              </collectionProp>
              <collectionProp name="1542629250">
                <stringProp name="1567">10</stringProp>
                <stringProp name="1567">10</stringProp>
                <stringProp reference="../../collectionProp[6]/stringProp[3]"/>
              </collectionProp>
              <collectionProp name="-190221553">
                <stringProp name="1567">10</stringProp>
                <stringProp name="53">5</stringProp>
                <stringProp reference="../../collectionProp[6]/stringProp[3]"/>
              </collectionProp>
              <collectionProp name="1925978402">
                <stringProp name="53">5</stringProp>
                <stringProp name="53">5</stringProp>
                <stringProp reference="../../collectionProp[6]/stringProp[3]"/>
              </collectionProp>
              <collectionProp name="1925949603">
                <stringProp name="53">5</stringProp>
                <stringProp name="49">1</stringProp>
                <stringProp reference="../../collectionProp[6]/stringProp[3]"/>
              </collectionProp>
              <collectionProp name="1926131424">
                <stringProp name="49">1</stringProp>
                <stringProp name="49">1</stringProp>
                <stringProp name="49586">200</stringProp>
              </collectionProp>
              <collectionProp name="1867453316">
                <stringProp name="1">1</stringProp>
                <stringProp name="48">0</stringProp>
                <stringProp name="48625">100</stringProp>
              </collectionProp>
            </collectionProp>
          </kg.apc.jmeter.timers.VariableThroughputTimer>
          <hashTree/>
          <kg.apc.jmeter.timers.VariableThroughputTimer guiclass="kg.apc.jmeter.timers.VariableThroughputTimerGui" testclass="kg.apc.jmeter.timers.VariableThroughputTimer" testname="tst-name" enabled="true">
            <collectionProp name="load_profile">
              <collectionProp name="-1907823806">
                <stringProp name="48625">100</stringProp>
                <stringProp name="48625">100</stringProp>
                <stringProp name="48625">100</stringProp>
              </collectionProp>
              <collectionProp name="-1906509127">
                <stringProp name="48625">100</stringProp>
                <stringProp name="48780">150</stringProp>
                <stringProp name="48625">100</stringProp>
              </collectionProp>
              <collectionProp name="-1865754078">
                <stringProp name="48780">150</stringProp>
                <stringProp name="48780">150</stringProp>
                <stringProp name="48625">100</stringProp>
              </collectionProp>
              <collectionProp name="-1833756467">
                <stringProp name="48780">150</stringProp>
                <stringProp name="49586">200</stringProp>
                <stringProp name="48625">100</stringProp>
              </collectionProp>
              <collectionProp name="-841830526">
                <stringProp name="49586">200</stringProp>
                <stringProp name="49586">200</stringProp>
                <stringProp name="48625">100</stringProp>
              </collectionProp>
              <collectionProp name="-839769150">
                <stringProp name="49586">200</stringProp>
                <stringProp name="49741">250</stringProp>
                <stringProp name="48625">100</stringProp>
              </collectionProp>
              <collectionProp name="-775866494">
                <stringProp name="49741">250</stringProp>
                <stringProp name="49741">250</stringProp>
                <stringProp name="48625">100</stringProp>
              </collectionProp>
              <collectionProp name="-26293066">
                <stringProp name="49741">250</stringProp>
                <stringProp name="50547">300</stringProp>
                <stringProp name="48625">100</stringProp>
              </collectionProp>
              <collectionProp name="1735646722">
                <stringProp name="50547">300</stringProp>
                <stringProp name="50547">300</stringProp>
                <stringProp name="48625">100</stringProp>
              </collectionProp>
              <collectionProp name="986073294">
                <stringProp name="50547">300</stringProp>
                <stringProp name="49741">250</stringProp>
                <stringProp name="48625">100</stringProp>
              </collectionProp>
              <collectionProp name="-775866494">
                <stringProp name="49741">250</stringProp>
                <stringProp name="49741">250</stringProp>
                <stringProp name="48625">100</stringProp>
              </collectionProp>
              <collectionProp name="-777927870">
                <stringProp name="49741">250</stringProp>
                <stringProp name="49586">200</stringProp>
                <stringProp name="48625">100</stringProp>
              </collectionProp>
              <collectionProp name="-841830526">
                <stringProp name="49586">200</stringProp>
                <stringProp name="49586">200</stringProp>
                <stringProp name="48625">100</stringProp>
              </collectionProp>
              <collectionProp name="-873828137">
                <stringProp name="49586">200</stringProp>
                <stringProp name="48780">150</stringProp>
                <stringProp name="48625">100</stringProp>
              </collectionProp>
              <collectionProp name="-1865754078">
                <stringProp name="48780">150</stringProp>
                <stringProp name="48780">150</stringProp>
                <stringProp name="48625">100</stringProp>
              </collectionProp>
              <collectionProp name="-1867068757">
                <stringProp name="48780">150</stringProp>
                <stringProp name="48625">100</stringProp>
                <stringProp name="48625">100</stringProp>
              </collectionProp>
              <collectionProp name="-1907823806">
                <stringProp name="48625">100</stringProp>
                <stringProp name="48625">100</stringProp>
                <stringProp name="48625">100</stringProp>
              </collectionProp>
              <collectionProp name="-1906509127">
                <stringProp name="48625">100</stringProp>
                <stringProp name="48780">150</stringProp>
                <stringProp name="48625">100</stringProp>
              </collectionProp>
              <collectionProp name="-1865754078">
                <stringProp name="48780">150</stringProp>
                <stringProp name="48780">150</stringProp>
                <stringProp name="48625">100</stringProp>
              </collectionProp>
              <collectionProp name="-840755936">
                <stringProp name="49586">200</stringProp>
                <stringProp name="49586">200</stringProp>
                <stringProp name="49586">200</stringProp>
              </collectionProp>
              <collectionProp name="-841830526">
                <stringProp name="49586">200</stringProp>
                <stringProp name="49586">200</stringProp>
                <stringProp name="48625">100</stringProp>
              </collectionProp>
            </collectionProp>
          </kg.apc.jmeter.timers.VariableThroughputTimer>
          <hashTree/>
        </hashTree>
      </hashTree>
      <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="RespTimeGraphVisualizer" testclass="ResultCollector" testname="Response Time Graph" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <stringProp name="filename">/home/ubuntu/Desktop/Experiments/test_017.csv</stringProp>
        <stringProp name="RespTimeGraph.interval">1000</stringProp>
      </ResultCollector>
      <hashTree/>
      <kg.apc.jmeter.vizualizers.CorrectedResultCollector guiclass="kg.apc.jmeter.vizualizers.TransactionsPerSecondGui" testclass="kg.apc.jmeter.vizualizers.CorrectedResultCollector" testname="jp@gc - Transactions per Second" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <longProp name="interval_grouping">1000</longProp>
        <boolProp name="graph_aggregated">false</boolProp>
        <boolProp name="include_checkbox_state">false</boolProp>
        <boolProp name="exclude_checkbox_state">false</boolProp>
      </kg.apc.jmeter.vizualizers.CorrectedResultCollector>
      <hashTree/>
      <kg.apc.jmeter.vizualizers.CorrectedResultCollector guiclass="kg.apc.jmeter.vizualizers.ThreadsStateOverTimeGui" testclass="kg.apc.jmeter.vizualizers.CorrectedResultCollector" testname="jp@gc - Active Threads Over Time" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <longProp name="interval_grouping">500</longProp>
        <boolProp name="graph_aggregated">false</boolProp>
        <boolProp name="include_checkbox_state">false</boolProp>
        <boolProp name="exclude_checkbox_state">false</boolProp>
      </kg.apc.jmeter.vizualizers.CorrectedResultCollector>
      <hashTree/>
      <kg.apc.jmeter.vizualizers.CorrectedResultCollector guiclass="kg.apc.jmeter.vizualizers.ResponseTimesOverTimeGui" testclass="kg.apc.jmeter.vizualizers.CorrectedResultCollector" testname="jp@gc - Response Times Over Time" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <longProp name="interval_grouping">500</longProp>
        <boolProp name="graph_aggregated">false</boolProp>
        <boolProp name="include_checkbox_state">false</boolProp>
        <boolProp name="exclude_checkbox_state">false</boolProp>
      </kg.apc.jmeter.vizualizers.CorrectedResultCollector>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>